Q1. List any five functions of the pandas library with execution.
__

In [3]:
import pandas as pd
data=[4,8,15,16,23,42]

## 1. Seies function will create a series
ser=pd.Series(data)
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
## 2. DataFrame function will create a DataFrame
data2={"Name": ["Alice","Bob","Claire"], "Age":[25,30,27], "Gender":["Female","Male","Female"]}
df=pd.DataFrame(data2,index=None)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [7]:
##3. dtypes will give datatypes
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [11]:
##4. sort_values will sort based on key

df.sort_values("Age",inplace=True)

In [12]:
df

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [13]:
##5. sort_index will sort based on index
df.sort_index(inplace=True)

In [14]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

*************
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.
***

In [15]:
data3={"A": ["Alice","Bob","Claire"], "B":[25,30,27], "C":["Female","Male","Female"]}
df1=pd.DataFrame(data3,index=None)
df1

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [19]:
df.reindex(index=range(1,6,2))

  Name   Age Gender
1  Bob  30.0   Male
3  NaN   NaN    NaN
5  NaN   NaN    NaN

****
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
***

In [29]:
data4={"Product": ["A","B","C","D","E"], "Values":[10,20,30,40,50]}
df2=pd.DataFrame(data4,index=None)

total=0
for index,row in df2.iterrows():
    if index <= 2:
        total=total+ row["Values"]
print("Sum of first 3 values is:", total)

Sum of first 3 values is: 60

***
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.
*********

In [35]:
data5={"Text": ["Hello There","How are you","I am good, how about you?","Good night","Good morning"]}
df3=pd.DataFrame(data5)

In [38]:
df3

                        Text
0                Hello There
1                How are you
2  I am good, how about you?
3                 Good night
4               Good morning

In [56]:
for index,row in df3.iterrows():
    df3["Word Count"]= len(row["Text"].split())

In [57]:
df3

                        Text  Word Count
0                Hello There           2
1                How are you           2
2  I am good, how about you?           2
3                 Good night           2
4               Good morning           2

***
Q5. How are DataFrame.size() and DataFrame.shape() different?
**
Answer: size will return total number of individual fields on Dataframe whereas shape will provide in (row, column) format

In [69]:

df3.size

10

In [68]:
df3.shape

(5, 2)

*****************
Q6. Which function of pandas do we use to read an excel file?

Answer: pandas.read_excel() function is used to read an excel file

****
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

*************

In [77]:
data6={"Email": ["amit@pwskills.com","sudh.verma@pwskills.com","Ani@pwskills.com"]}
df4=pd.DataFrame(data6)

In [78]:
df4

                     Email
0        amit@pwskills.com
1  sudh.verma@pwskills.com
2         Ani@pwskills.com

In [79]:
def getuser(x):
    return(x.split('@')[0])

df4["Username"] = df4["Email"].apply(getuser)

In [80]:
df4

                     Email    Username
0        amit@pwskills.com        amit
1  sudh.verma@pwskills.com  sudh.verma
2         Ani@pwskills.com         Ani

************

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [82]:
data7={"A": [3,8,6,2,9,8,9], "B":[5,2,9,3,1,2,1], "C":[1,7,4,5,2,7,2]}
df5=pd.DataFrame(data7)

In [83]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2
5  8  2  7
6  9  1  2

In [92]:
df5[(df5["A"]>5) & (df5["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2
5  8  2  7
6  9  1  2

***
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [96]:
data8={"Values": [3,8,6,2,9,8,9]}
df6=pd.DataFrame(data8)

print("Mean:",df6["Values"].mean())
print("median:",df6["Values"].median())
print("standard deviation:",df6["Values"].std())

Mean: 6.428571428571429
median: 8.0
standard deviation: 2.878491668515698

******
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [99]:
data9={ "Sales":[5,2,9,3,1,2,1,5,41,20], "Date":['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08','2023-01-09','2023-01-010']}
df6=pd.DataFrame(data9)


df6["MovingAverage"]=df6["Sales"].rolling(window=7).mean()

In [100]:
df6

   Sales         Date  MovingAverage
0      5   2023-01-01            NaN
1      2   2023-01-02            NaN
2      9   2023-01-03            NaN
3      3   2023-01-04            NaN
4      1   2023-01-05            NaN
5      2   2023-01-06            NaN
6      1   2023-01-07       3.285714
7      5   2023-01-08       3.285714
8     41   2023-01-09       8.857143
9     20  2023-01-010      10.428571

****
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [5]:
data10={"Date":['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08','2023-01-09','2023-01-10']}
df9=pd.DataFrame(data10)

In [6]:
df9["Updated Date"]=pd.to_datetime(df9["Date"])

In [8]:
df9["Weekday"]=df9["Updated Date"].dt.day_name()

In [11]:
df9.drop("Updated Date",axis=1,inplace=True)
df9

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday
6  2023-01-07   Saturday
7  2023-01-08     Sunday
8  2023-01-09     Monday
9  2023-01-10    Tuesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [15]:
data11={"Date":['2023-01-01','2023-10-02','2023-12-03','2021-01-04','2023-01-05','2023-01-06','2020-01-07','2023-01-08','2023-01-09','2023-01-10']}
df10=pd.DataFrame(data11)


df10[(df10["Date"] >= '2023-01-01') & (df10["Date"] <= '2023-01-31')]

         Date
0  2023-01-01
4  2023-01-05
5  2023-01-06
7  2023-01-08
8  2023-01-09
9  2023-01-10

****
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?
Answer: 
import pandas should be the first library to be imported for basic functions